Documents/ВедомостьНаПеречислениеПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаПеречислениеПрочихВыплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСуммКПеречислению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиГлавногоБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоПрочимВыплатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоПрочимВыплатам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗадолженностиЗаМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОстаткамЗадолженностиНаКонецМесяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВедомостьНаПеречислениеПрочихВыплат/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер");
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = ПрочиеВыплаты.Итог("Сумма");

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ПрочиеВыплаты.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаПлатежа");	
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// движение в документах списания ДС
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Возврат;	
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.ВедомостьНаПеречислениеПрочихВыплат.ПодготовитьПараметрыПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВзаиморасчетыПоПрочимВыплатам.Записывать = Истина;
	Движения.ВзаиморасчетыПоПрочимВыплатам.Загрузить(ПараметрыПроведения.ДанныеПрочихВыплат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МожноЗаполнитьПрочиеВыплаты() Экспорт
	
	ПравилаПроверки = Новый Структура;
	
	ПравилаПроверки.Вставить("Организация",					НСтр("ru='Не выбрана организация'"));
	ПравилаПроверки.Вставить("ПериодВзаиморасчетов",		НСтр("ru='Не задан период взаиморасчетов'"));
	ПравилаПроверки.Вставить("Дата",						НСтр("ru='Не задана дата документа'"));
	ПравилаПроверки.Вставить("ВидПрочихВыплат",				НСтр("ru='Не задан вид прочих выплат'"));
	ПравилаПроверки.Вставить("СпособРасчетаСуммКПеречислению", НСтр("ru='Не указан способ расчета сумм к перечислению'"));
	
	Возврат	ЗарплатаКадры.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки);

КонецФункции

#Область ПроцедурыИФункцииЗаполненияДокумента

Функция ПараметрыПолученияПрочиеВыплаты(Ведомость) Экспорт
		
	ПараметрыПолученияПрочиеВыплаты = Новый Структура;
	ПараметрыПолученияПрочиеВыплаты.Вставить("Организация",				Справочники.Организации.ПустаяСсылка());
	ПараметрыПолученияПрочиеВыплаты.Вставить("Подразделение",			Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ПараметрыПолученияПрочиеВыплаты.Вставить("ВидПрочихВыплат",         Справочники.ВидыПрочихВыплат.ПустаяСсылка());
	ПараметрыПолученияПрочиеВыплаты.Вставить("ПериодВзаиморасчетов",	Дата(1,1,1));
	ПараметрыПолученияПрочиеВыплаты.Вставить("Дата",					Дата(1,1,1));
	
	ПараметрыПолученияПрочиеВыплаты.Организация				= Ведомость.Организация;
	ПараметрыПолученияПрочиеВыплаты.Подразделение			= Ведомость.Подразделение;
	ПараметрыПолученияПрочиеВыплаты.ВидПрочихВыплат			= Ведомость.ВидПрочихВыплат; 
	ПараметрыПолученияПрочиеВыплаты.ПериодВзаиморасчетов	= Ведомость.ПериодВзаиморасчетов;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Если Ведомость.Проведен И ЗначениеЗаполнено(Ведомость.ДатаПлатежа) Тогда
			ПараметрыПолученияПрочиеВыплаты.Дата = ?(ЗначениеЗаполнено(Ведомость.Ссылка), Ведомость.ДатаПлатежа, ТекущаяДатаСеанса());
		Иначе
			ПараметрыПолученияПрочиеВыплаты.Дата = ?(ЗначениеЗаполнено(Ведомость.Ссылка), Ведомость.Дата, ТекущаяДатаСеанса());
		КонецЕсли;
	Иначе
		ПараметрыПолученияПрочиеВыплаты.Дата = ?(ЗначениеЗаполнено(Ведомость.Ссылка), Ведомость.Дата, ТекущаяДатаСеанса());
	КонецЕсли;

	Возврат ПараметрыПолученияПрочиеВыплаты;
	
КонецФункции

Процедура СоздатьВТПрочиеВыплаты(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ФизическиеЛица = Неопределено) Экспорт
	
	РегистрацияНООрганизация = ЗарплатаКадры.РегистрацияВНалоговомОрганеОрганизации(Параметры.Организация, Параметры.ПериодВзаиморасчетов);
	
	Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		РегистрацияНОПодразделения = ЗарплатаКадры.РегистрацияВНалоговомОрганеОрганизации(Параметры.Подразделение, Параметры.ПериодВзаиморасчетов);
	Иначе
		РегистрацияНОПодразделения = РегистрацияНООрганизация;
	КонецЕсли;
	
	Если ФизическиеЛица = Неопределено Тогда
		УсловиеФизическиеЛица = "";
	Иначе
		УсловиеФизическиеЛица = "И ФизическоеЛицо В (&ФизическиеЛица)";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УничтожитьВТ = Новый Массив;
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("ПериодВзаиморасчетов", Параметры.ПериодВзаиморасчетов);
	Запрос.УстановитьПараметр("ВидПрочихВыплат", Параметры.ВидПрочихВыплат);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияНОПодразделения);
	
	ПоЗадолженностиЗаМесяц = (СпособРасчетаСуммКПеречислению = Перечисления.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПоЗадолженностиЗаМесяц);
	
	КонецПериодаГраница = Новый Граница(Макс(КонецМесяца(Параметры.Дата), КонецМесяца(Параметры.ПериодВзаиморасчетов)));
	//КонецПериодаГраница = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	
	Запрос.УстановитьПараметр("КонецПериодаГраница", КонецПериодаГраница);

	Запрос.Текст = Запрос.Текст  + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	СУММА(ВзаиморасчетыПоПрочимВыплатамОстатки.СуммаВзаиморасчетовОстаток) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТВзаиморасчетыПоПрочимВыплатамОстатки
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
    // или в СП - ПустаяСсылка или только по голове
	|				И Подразделение = &Подразделение
	|				" + УсловиеФизическиеЛица + "
	|				И ВидПрочихВыплат = &ВидПрочихВыплат
	|				" + ?(ПоЗадолженностиЗаМесяц, "
	|				И ПериодВзаиморасчетов МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодВзаиморасчетов, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодВзаиморасчетов, МЕСЯЦ)", "
	|				И ПериодВзаиморасчетов <= КОНЕЦПЕРИОДА(&ПериодВзаиморасчетов, МЕСЯЦ)") + ") КАК ВзаиморасчетыПоПрочимВыплатамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.ФизическоеЛицо,
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.ПериодВзаиморасчетов";

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьПрочиеВыплаты() Экспорт

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияПрочиеВыплаты = ПараметрыПолученияПрочиеВыплаты(ЭтотОбъект);
	СоздатьВТПрочиеВыплаты(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияПрочиеВыплаты);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоПрочимВыплатам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВзаиморасчетыПоПрочимВыплатам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВзаиморасчетыПоПрочимВыплатам.СуммаВзаиморасчетов КАК Сумма
	|ИЗ
	|	ВТВзаиморасчетыПоПрочимВыплатамОстатки КАК ВзаиморасчетыПоПрочимВыплатам
    |
    |УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо
	|";

	ПрочиеВыплатыОстатки = Запрос.Выполнить().Выгрузить();

	ЗаполнитьПоТаблицеПрочиеВыплаты(ЭтотОбъект, ПрочиеВыплатыОстатки);
	
КонецПроцедуры

Процедура ДополнитьПрочиеВыплаты(ФизическиеЛица) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	ПараметрыПолученияПрочиеВыплаты = ПараметрыПолученияПрочиеВыплаты(ЭтотОбъект);
	СоздатьВТПрочиеВыплаты(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияПрочиеВыплаты, ФизическиеЛица);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоПрочимВыплатам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВзаиморасчетыПоПрочимВыплатам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВзаиморасчетыПоПрочимВыплатам.СуммаВзаиморасчетов КАК Сумма                         
	|ИЗ
	|	ВТВзаиморасчетыПоПрочимВыплатамОстатки КАК ВзаиморасчетыПоПрочимВыплатам
    |
    |УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо
	|";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ПрочиеВыплаты.Добавить(), Выборка);
		
	КонецЦикла;
	
	Для Каждого Элемент Из ФизическиеЛица Цикл
		
		НайденнаяСтрока = ПрочиеВыплаты.Найти(Элемент,"ФизическоеЛицо");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для физического лица: %1 отсутствуют остатки по виду прочей выплаты: %2 на %3'"),
				Элемент, ВидПрочихВыплат, Формат(ПериодВзаиморасчетов, "ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоТаблицеПрочиеВыплаты(Ведомость, ТаблицаПрочиеВыплаты) Экспорт
	
	ПрочиеВыплаты.Загрузить(ТаблицаПрочиеВыплаты);
	
	// Убираем нулевые строки
	УдаляемыеСтрокиПрочиеВыплаты = Новый Массив;
	Для Каждого СтрокаПрочиеВыплаты Из ПрочиеВыплаты Цикл
		Если СтрокаПрочиеВыплаты.Сумма = 0 Тогда
			УдаляемыеСтрокиПрочиеВыплаты.Добавить(СтрокаПрочиеВыплаты);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого УдаляемаяСтрокаПрочиеВыплаты Из УдаляемыеСтрокиПрочиеВыплаты Цикл
		ПрочиеВыплаты.Удалить(УдаляемаяСтрокаПрочиеВыплаты);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
